[
  {
    "author": "Nick Valdez",
    "title": "My Hero Academia Explains Why Hawks Admires Endeavor Despite His Abusive Past",
    "description": "My Hero Academia's newest chapter explained why Hawks still admires Endeavor despite the current number one hero's abusive past. Kohei Horikoshi's original manga series is now in the midst of exploring the fallout of the massive war between the heroes and the…",
    "url": "https://comicbook.com/anime/news/my-hero-academia-hawks-admires-endeavor-abusive-past-explained-spoilers/",
    "urlToImage": "https://media.comicbook.com/2021/03/my-hero-academia-hawks-endeavor-admires-abusive-past-explained-s-1258857-1280x0.jpeg",
    "publishedAt": "2021-03-01T23:28:00Z",
    "content": "My Hero Academia's newest chapter explained why Hawks still admires Endeavor despite the current number one hero's abusive past. Kohei Horikoshi's original manga series is now in the midst of explori… [+2250 chars]"
  },
  {
    "author": "Megan Peters",
    "title": "My Hero Academia Reveals Why All Might Is the Perfect One For All User",
    "description": "All Might might not be at the frontline of war these days, but the man will always be known as the Symbol of Peace. His work as a pro hero gave hope to millions, and his success is thanks to training with One For All. If you did not know, Yagi worked hard to …",
    "url": "https://comicbook.com/anime/news/my-hero-academia-all-might-perfect-one-for-all-user/",
    "urlToImage": "https://media.comicbook.com/2018/06/all-might-1113356-1280x0.jpeg",
    "publishedAt": "2021-03-08T22:27:00Z",
    "content": "All Might might not be at the frontline of war these days, but the man will always be known as the Symbol of Peace. His work as a pro hero gave hope to millions, and his success is thanks to training… [+1641 chars]"
  },
  {
    "author": "Evan Valentine",
    "title": "My Hero Academia Reveals How the Fourth One For All Really Died",
    "description": "The latest chapter of My Hero Academia has given readers a veritable onslaught of information when it comes to the Quirk that powered both Midoriya and All Might in One For All, and Kohei Horikoshi has revealed not only the identity of the fourth wielder of t…",
    "url": "https://comicbook.com/anime/news/my-hero-academia-manga-304-fourth-all-for-one-death/",
    "urlToImage": "https://media.comicbook.com/2021/03/my-hero-academia-fourth-death-1259799-1280x0.jpeg",
    "publishedAt": "2021-03-09T16:22:00Z",
    "content": "The latest chapter of My Hero Academia has given readers a veritable onslaught of information when it comes to the Quirk that powered both Midoriya and All Might in One For All, and Kohei Horikoshi h… [+2001 chars]"
  },
  {
    "author": "Megan Peters",
    "title": "My Hero Academia Season 5 Will Kick-Off with a Recap Episode",
    "description": "My Hero Academia is almost ready to step out with its new season, and fans are rightfully hyped. If you did not know, the show will make its comeback in a few weeks, and this new season promises to introduce a new side of One For All. Now, some new informatio…",
    "url": "https://comicbook.com/anime/news/my-hero-academia-season-5-premiere-recap-anime/",
    "urlToImage": "https://media.comicbook.com/2021/02/my-hero-academia-season-five-1258566-1280x0.jpeg",
    "publishedAt": "2021-03-11T19:13:00Z",
    "content": "My Hero Academia is almost ready to step out with its new season, and fans are rightfully hyped. If you did not know, the show will make its comeback in a few weeks, and this new season promises to i… [+1544 chars]"
  },
  {
    "author": "Megan Peters",
    "title": "My Hero Academia Season 5 Will Share New Details at Anime Japan",
    "description": "My Hero Academia is just weeks out from its big comeback, and fans are eyeing season five with lots of hype. If you did not know, the anime is set to tackle some of its most intense arcs to date this year, and fans can look forward to getting a new update on …",
    "url": "https://comicbook.com/anime/news/my-hero-academia-season-5-update-anime-japan/",
    "urlToImage": "https://media.comicbook.com/2021/02/my-hero-academia-season-5-deku-one-for-all-power-blackwhip-1258604-1280x0.jpeg",
    "publishedAt": "2021-03-14T14:28:00Z",
    "content": "My Hero Academia is just weeks out from its big comeback, and fans are eyeing season five with lots of hype. If you did not know, the anime is set to tackle some of its most intense arcs to date this… [+1669 chars]"
  },
  {
    "author": "Evan Valentine",
    "title": "My Hero Academia Season 5 Premiere Date On Funimation & Crunchyroll Revealed",
    "description": "My Hero Academia fans have been waiting for quite some time since the fourth season came to an end with a big cliffhanger for Midoriya and the Quirk known as One For All, but it seems that said fans won't have to wait much longer as the anime series has revea…",
    "url": "https://comicbook.com/anime/news/my-hero-academia-season-5-premiere-date-funimation-crunchyrol/",
    "urlToImage": "https://media.comicbook.com/2021/03/my-hero-academia-season-five-premiere-date-1261691-1280x0.jpeg",
    "publishedAt": "2021-03-23T21:30:00Z",
    "content": "My Hero Academiafans have been waiting for quite some time since the fourth season came to an end with a big cliffhanger for Midoriya and the Quirk known as One For All, but it seems that said fans w… [+2198 chars]"
  },
  {
    "author": "Evan Valentine",
    "title": "My Hero Academia Explains Why the Fourth One For All User Died",
    "description": "My Hero Academia's War Arc has come to a close in the pages of its manga, with the heroes attempting to lick their wounds and pick up the pieces from their deadly battle against the villains of the Paranormal Liberation Front, and Midoriya has taken the oppor…",
    "url": "https://comicbook.com/anime/news/my-hero-academia-manga-304-spoilers-why-the-fourth-one-for-all-user-died/",
    "urlToImage": "https://media.comicbook.com/2021/03/my-hero-academia-fourth-1260357-1280x0.jpeg",
    "publishedAt": "2021-03-12T23:43:00Z",
    "content": "My Hero Academia'sWar Arc has come to a close in the pages of its manga, with the heroes attempting to lick their wounds and pick up the pieces from their deadly battle against the villains of the Pa… [+2137 chars]"
  },
  {
    "author": "Megan Peters",
    "title": "My Hero Academia Cliffhanger Drops a Big DC Comics Easter Egg",
    "description": "When it comes to My Hero Academia, the manga plays off the long history of heroes before it. Kohei Horikoshi is a well-known fanboy where comics are concerned, so it is no surprise to see him make homages in his own series. Of course, this means fans are alwa…",
    "url": "https://comicbook.com/anime/news/my-hero-academia-manga-306-dc-comics-easter-egg/",
    "urlToImage": "https://media.comicbook.com/2021/03/batman-mha-1261615-1280x0.jpeg",
    "publishedAt": "2021-03-23T14:18:00Z",
    "content": "When it comes to My Hero Academia, the manga plays off the long history of heroes before it. Kohei Horikoshi is a well-known fanboy where comics are concerned, so it is no surprise to see him make ho… [+1846 chars]"
  },
  {
    "author": "Nick Valdez",
    "title": "My Hero Academia Creator Readies for Season 5 Premiere with Adorable Sketch",
    "description": "My Hero Academia's creator is getting ready for its big Season 5 premiere with an adorable new sketch! Kohei Horikoshi's franchise is getting ready to celebrate the fifth anniversary of its anime adaptation, and this will kick off with the return of the anime…",
    "url": "https://comicbook.com/anime/news/my-hero-academia-season-5-premiere-kohei-horikoshi-sketch/",
    "urlToImage": "https://media.comicbook.com/2021/03/my-hero-academia-season-5-premiere-kohei-horikoshi-sketch-1261686-1280x0.jpeg",
    "publishedAt": "2021-03-23T20:57:00Z",
    "content": "My Hero Academia's creator is getting ready for its big Season 5 premiere with an adorable new sketch! Kohei Horikoshi's franchise is getting ready to celebrate the fifth anniversary of its anime ada… [+2068 chars]"
  },
  {
    "author": "Megan Peters",
    "title": "My Hero Academia Confirms All For One's Real Plans for Shigaraki",
    "description": "From day one, fans of My Hero Academia knew there was something special to One For All, and it didn't take long for the quirk's other half to pop up. The history of All For One is horrifying, to say the least, and its legacy with Shigaraki has only gotten wor…",
    "url": "https://comicbook.com/anime/news/my-hero-academia-manga-all-for-one-shigaraki-real-plans/",
    "urlToImage": "https://media.comicbook.com/2018/06/mha-all-for-one-1116359-1280x0.jpeg",
    "publishedAt": "2021-03-15T18:44:00Z",
    "content": "From day one, fans of My Hero Academia knew there was something special to One For All, and it didn't take long for the quirk's other half to pop up. The history of All For One is horrifying, to say … [+1313 chars]"
  },
  {
    "author": "Megan Peters",
    "title": "My Hero Academia Explains How One For All Can Be Stolen",
    "description": "My Hero Academia has made several things clear about One For All, and one very important fact shared early on had to do with its safety. All Might gave his assurance the quirk could not be taken with force, but it seems that might not be the truth. Thanks to …",
    "url": "https://comicbook.com/anime/news/my-hero-academia-manga-35-one-for-all-stolen-rules/",
    "urlToImage": "https://media.comicbook.com/2021/02/my-hero-academia-season-5-izuku-midoriya-deku-anime-1258627-1280x0.jpeg",
    "publishedAt": "2021-03-15T21:00:00Z",
    "content": "My Hero Academia has made several things clear about One For All, and one very important fact shared early on had to do with its safety. All Might gave his assurance the quirk could not be taken with… [+1654 chars]"
  },
  {
    "author": "Nick Valdez",
    "title": "My Hero Academia Explains Why Izuku is Determined to Save Shigaraki",
    "description": "My Hero Academia explains why Izuku Midoriya is determined to save Tomura Shigaraki with the newest chapter of the series. During the fight against the full powered All For One versus the growing power of One For All within Izuku and Shigaraki, the two powers…",
    "url": "https://comicbook.com/anime/news/my-hero-academia-spoilers-why-izuku-wants-to-save-shigaraki-explained/",
    "urlToImage": "https://media.comicbook.com/2021/03/my-hero-academia-izuku-vow-to-save-shigaraki-explained-spoilers-1260685-1280x0.jpeg",
    "publishedAt": "2021-03-16T03:39:00Z",
    "content": "My Hero Academia explains why Izuku Midoriya is determined to save Tomura Shigaraki with the newest chapter of the series. During the fight against the full powered All For One versus the growing pow… [+2287 chars]"
  },
  {
    "author": "Evan Valentine",
    "title": "My Hero Academia to Get Fashion Collection From Pharrell Williams' Line",
    "description": "My Hero Academia is set to return with the fifth season of its anime later this month, and it seems as if singer/songwriter Pharrell Williams is getting in on the action of UA Academy as his clothing line, \"ICECREAM\", is set to release some new attire with so…",
    "url": "https://comicbook.com/anime/news/my-hero-academia-pharrell-williams-clothing-line/",
    "urlToImage": "https://media.comicbook.com/2021/03/my-hero-academia-pharell-1260169-1280x0.jpeg",
    "publishedAt": "2021-03-11T18:39:00Z",
    "content": "My Hero Academia is set to return with the fifth season of its anime later this month, and it seems as if singer/songwriter Pharrell Williams is getting in on the action of UA Academy as his clothing… [+2040 chars]"
  },
  {
    "author": "Megan Peters",
    "title": "My Hero Academia: What We Know About One For All's Two Mysterious Users",
    "description": "When My Hero Academia began years ago, fans did not realize how pivotal One For All was going to be. The series made it clear that Izuku was being given a gift once All Might passed the power on, but no one knew how much of a gift he got until recently. One F…",
    "url": "https://comicbook.com/anime/news/my-hero-academia-manga-mystery-one-for-all-second-third-user/",
    "urlToImage": "https://media.comicbook.com/2021/03/my-hero-academia-1260503-1280x0.jpeg",
    "publishedAt": "2021-03-14T18:15:00Z",
    "content": "When My Hero Academia began years ago, fans did not realize how pivotal One For All was going to be. The series made it clear that Izuku was being given a gift once All Might passed the power on, but… [+1655 chars]"
  },
  {
    "author": "Nick Valdez",
    "title": "My Hero Academia Explains Why Izuku is Likely the Last One For All Holder",
    "description": "My Hero Academia explains why Izuku Midoriya is most likely the final One For All holder in the newest chapter of the series! Kohei Horikoshi's original manga series is currently exploring the immediate fallout of the massive fight between the heroes and vill…",
    "url": "https://comicbook.com/anime/news/my-hero-academia-izuku-last-one-for-all-holder-possibility-spoilers-manga/",
    "urlToImage": "https://media.comicbook.com/2021/03/my-hero-academia-izuku-last-one-for-all-user-spoilers-manga-1259954-1280x0.jpeg",
    "publishedAt": "2021-03-10T04:00:00Z",
    "content": "My Hero Academia explains why Izuku Midoriya is most likely the final One For All holder in the newest chapter of the series! Kohei Horikoshi's original manga series is currently exploring the immedi… [+2462 chars]"
  },
  {
    "author": "Megan Peters",
    "title": "My Hero Academia Unveils the Failed Attempts to Hijack One For All",
    "description": "My Hero Academia has been diving heavily into One For All as of late, and the lessons have been much overdue. Ever since the power was first shown to fans, netizens were left to theorize about its history. Now, those fans have been told all about One For All'…",
    "url": "https://comicbook.com/anime/news/my-hero-academia-manga-305-one-for-all-theft-history/",
    "urlToImage": "https://media.comicbook.com/2018/08/my-hero-academia-one-for-all-1129705-1280x0.jpeg",
    "publishedAt": "2021-03-16T20:21:00Z",
    "content": "My Hero Academia has been diving heavily into One For All as of late, and the lessons have been much overdue. Ever since the power was first shown to fans, netizens were left to theorize about its hi… [+1419 chars]"
  },
  {
    "author": "Nick Valdez",
    "title": "My Hero Academia Reveals Endeavor's Plans to Atone for His Past",
    "description": "My Hero Academia revealed Endeavor's plans to atone for his past with the newest chapter of the series. While the main core of the series is all about Izuku Midoriya, Tomura Shigaraki, and the clash between One For All and All For One, one of the major thread…",
    "url": "https://comicbook.com/anime/news/my-hero-academia-endeavor-atones-for-past-plans-spoilers-manga/",
    "urlToImage": "https://media.comicbook.com/2021/03/my-hero-academia-endeavor-plans-to-atone-spoilers-manga-1261571-1280x0.jpeg",
    "publishedAt": "2021-03-22T23:58:00Z",
    "content": "My Hero Academia revealed Endeavor's plans to atone for his past with the newest chapter of the series. While the main core of the series is all about Izuku Midoriya, Tomura Shigaraki, and the clash … [+2346 chars]"
  },
  {
    "author": "Alissa McAloon",
    "title": "Turning an audience into an engaged fandom, the Monster Prom way",
    "description": "The right level of attention can cultivate an audience into a dedicated fanbase that weaves itself into the worlds and characters powering the games you create. Here's why you should! ...",
    "url": "https://www.gamasutra.com/view/news/378507/Turning_an_audience_into_an_engaged_fandom_the_Monster_Prom_way.php?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+GamasutraFeatureArticles+%28Gamasutra+Feature+Articles%29",
    "urlToImage": "http://www.gamasutra.com/db_area/images/news/2021/Mar/378507/fandom235.jpg",
    "publishedAt": "2021-03-15T18:39:00Z",
    "content": "There's value in building a strong audience for your game, but, as Beautiful Glitch creative director Julian Quijano explains in his GDC Showcase talk \"Fandom-Ready: Creating Fiction in the Age of Fa… [+8657 chars]"
  },
  {
    "author": "Evan Valentine",
    "title": "What Does Being My Hero Academia's Number One Hero Even Mean Anymore?",
    "description": "The Hero Rankings are a major aspect of hero society, with civilians normally looking to the heroes higher on the Billboard Chart and crime fighter aspiring to reach the top to act as the strongest heroes in the world, but in My Hero Academia's anime and mang…",
    "url": "https://comicbook.com/anime/news/my-hero-academia-number-one-hero-meaning-all-might-midoriya/",
    "urlToImage": "https://media.comicbook.com/2021/03/my-hero-academia-hero-rankings-1259310-1280x0.jpeg",
    "publishedAt": "2021-03-04T22:52:00Z",
    "content": "The Hero Rankings are a major aspect of hero society, with civilians normally looking to the heroes higher on the Billboard Chart and crime fighter aspiring to reach the top to act as the strongest h… [+2403 chars]"
  },
  {
    "author": "Sean Fallon",
    "title": "New Summer Sandals Include Designs for SpongeBob, Naruto, Dragon Ball and More",
    "description": "The summer will be here before you know it, and your comfortable footwear options for the warm weather have grown thanks to Hot Topic. They've added a bunch of new slide sandal styles with designs for fans of Naruto, Dragon Ball, My Hero Academia, SpongeBob S…",
    "url": "https://comicbook.com/anime/news/spongebob-naruto-dragon-ball-baby-yoda-sandals-hot-topic/",
    "urlToImage": "https://media.comicbook.com/2021/03/hot-topic-sandals-top-1259097-1280x0.jpeg",
    "publishedAt": "2021-03-03T15:56:00Z",
    "content": "The summer will be here before you know it, and your comfortable footwear options for the warm weather have grown thanks to Hot Topic. They've added a bunch of new slide sandal styles with designs fo… [+876 chars]"
  }
]