[
  {
    "author": "Reuters Staff",
    "title": "Ryanair expects 16 Boeing 737 MAX deliveries by summer, says CEO - Reuters",
    "description": "Ryanair said it expected to take delivery of 16 Boeing 737 MAX aircraft before the coming summer season, lower than the previous guidance of up to 24 it had given in February.",
    "url": "https://www.reuters.com/article/health-coronavirus-britain-ryanair-boein-idUSS8N2KU061",
    "urlToImage": "https://s1.reutersmedia.net/resources_v2/images/rcom-default.png?w=800",
    "publishedAt": "2021-03-24T11:23:00Z",
    "content": "By Reuters Staff\r LONDON, March 24 (Reuters) - Ryanair said it expected to take delivery of 16 Boeing 737 MAX aircraft before the coming summer season, lower than the previous guidance of up to 24 it… [+383 chars]"
  },
  {
    "author": null,
    "title": "'Safe and secure' Olympics to take place this year - IOC president Bach",
    "description": "International Olympic Committee president Thomas Bach promises to deliver a \"safe and secure\" Tokyo Olympics this year.",
    "url": "https://www.bbc.co.uk/sport/olympics/56341991",
    "urlToImage": "https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/4A26/production/_116628981_olympics_epa.jpg",
    "publishedAt": "2021-03-10T16:32:11Z",
    "content": "The Tokyo 2020 Olympics were due to begin on 24 July last year\r A \"safe and secure\" Tokyo Olympics will happen this year, International Olympic Committee (IOC) president Thomas Bach says.\r The German… [+1171 chars]"
  },
  {
    "author": "Alison Frankel",
    "title": "Class counsel in Apple ‘throttling’ case beat multifront attack to land $81 million in fees - Reuters",
    "description": "Has there ever been a fee request attacked from more vantages than a motion last summer (2020 WL 7329350) for $87.7 million by class counsel in a $310 million settlement with Apple?",
    "url": "https://www.reuters.com/article/legal-us-otc-apple-idUSKBN2BA2P6",
    "urlToImage": "https://s1.reutersmedia.net/resources_v2/images/rcom-default.png?w=800",
    "publishedAt": "2021-03-18T20:49:00Z",
    "content": "(Reuters) - Has there ever been a fee request attacked from more vantages than a motion last summer for $87.7 million by class counsel in a $310 million settlement with Apple?\r Sure, objecting class … [+5862 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "Tokyo 2020 likely won't allow foreign Olympic volunteers: Kyodo - Reuters",
    "description": "The Tokyo 2020 Olympic Organising Committee is leaning towards barring foreign volunteers from helping at the delayed Games this summer, amid public concerns over the coronavirus, Kyodo news service reported on Saturday.",
    "url": "https://www.reuters.com/article/us-olympics-2020-idUSKBN2BC04K",
    "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210320&t=2&i=1555555994&r=LYNXMPEH2J01I&w=800",
    "publishedAt": "2021-03-20T03:51:00Z",
    "content": "By Reuters Staff\r FILE PHOTO: The Olympic torch of the Tokyo 2020 Olympic Games is displayed at the organising committee office, ahead of the start of the torch relay on March 25, 2021, in Tokyo, Jap… [+1610 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "QUOTES-Tokyo 2020 torch relay sets off on four-month journey - Reuters",
    "description": "The Olympic torch relay set off from Fukushima on Thursday, beginning a four-month countdown to the summer Games in Tokyo, delayed from 2020 and the first ever organised during a global pandemic.",
    "url": "https://www.reuters.com/article/olympics-2020-relay-idUSL4N2LN0PA",
    "urlToImage": "https://s1.reutersmedia.net/resources_v2/images/rcom-default.png?w=800",
    "publishedAt": "2021-03-25T02:16:00Z",
    "content": "By Reuters Staff\r (Quotes from officials and others)\r TOKYO, March 25 (Reuters) - The Olympic torch relay set off from Fukushima on Thursday, beginning a four-month countdown to the summer Games in T… [+1328 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "Rapid COVID-19 tests work as well as quarantine for travel: research - Reuters",
    "description": "Rapid antigen tests on arrival after travel can be just as effective as quarantining to stop imported cases of COVID-19, according to new research which the travel industry hopes will convince Britain to open up its borders this summer.",
    "url": "https://www.reuters.com/article/uk-health-coronavirus-britain-airlines-idUSKBN2BH01B",
    "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210325&t=2&i=1556109505&r=LYNXMPEH2O00K&w=800",
    "publishedAt": "2021-03-25T00:07:00Z",
    "content": "By Reuters Staff\r Passengers wearing face masks wait in front of the check-in counters at Gatwick Airport, amid the coronavirus disease (COVID-19) outbreak, in Gatwick, Britain June 15, 2020. REUTERS… [+1779 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "Shakespeare company to resume shows for audiences in outdoor theatre - Reuters",
    "description": "Britain's Royal Shakespeare Company will resume performances for live audiences in a specially constructed outdoor theatre in the summer, beginning with a production of \"The Comedy of Errors\", it said on Friday.",
    "url": "https://www.reuters.com/article/us-britain-theatre-shakespeare-idUSKBN2B4215",
    "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210312&t=2&i=1554694329&r=LYNXMPEH2B16C&w=800",
    "publishedAt": "2021-03-12T16:00:00Z",
    "content": "By Reuters Staff\r LONDON (Reuters) - Britains Royal Shakespeare Company will resume performances for live audiences in a specially constructed outdoor theatre in the summer, beginning with a producti… [+1589 chars]"
  },
  {
    "author": "Steve Keating",
    "title": "Tumbling and 'the talk' now part of gymnastics, says Raisman - Reuters",
    "description": "For young gymnasts heading to summer camp it is no longer just fun and games - it also means having \"the talk\", said three-time Olympic champion Aly Raisman as the sport continues to come to grips with sexual abuse scandals.",
    "url": "https://www.reuters.com/article/us-gymnastics-abuse-raisman-idUSKBN2B72FX",
    "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210315&t=2&i=1554972750&r=LYNXMPEH2E1H8&w=800",
    "publishedAt": "2021-03-15T18:11:00Z",
    "content": "(Reuters) - For young gymnasts heading to summer camp it is no longer just fun and games - it also means having the talk, said three-time Olympic champion Aly Raisman as the sport continues to come t… [+4399 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "UK to pilot COVID-19 certificates to reopen sports events - Reuters",
    "description": "Britain will pilot using COVID-19 certificates to re-open sport to fans, culture minister Oliver Dowden said on Friday, saying it was crucial to get crowds back to major events this summer for the future of the industry.",
    "url": "https://www.reuters.com/article/us-health-coronavirus-britain-certificat-idUSKBN2BB0LN",
    "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210319&t=2&i=1555450825&r=LYNXMPEH2I0BP&w=800",
    "publishedAt": "2021-03-19T07:35:00Z",
    "content": "By Reuters Staff\r FILE PHOTO: Britain's Secretary of State for Digital, Culture, Media and Sport Oliver Dowden leaves Downing Street in London, Britain, February 3, 2021. REUTERS/John Sibley\r LONDON … [+695 chars]"
  },
  {
    "author": "Aidan Lewis, Mohamed Abdellah",
    "title": "Egypt prepares to start move to new capital, away from the chaos of Cairo - Reuters",
    "description": "Egypt is racing to prepare a grandiose new capital city in the desert east of Cairo before the first civil servants move in this summer and ahead of the delayed official opening of President Abdel Fattah al-Sisi's flagship project.",
    "url": "https://www.reuters.com/article/egypt-new-capital-idUSL8N2LF26T",
    "urlToImage": "https://s1.reutersmedia.net/resources_v2/images/rcom-default.png?w=800",
    "publishedAt": "2021-03-17T12:34:00Z",
    "content": "* Spokesman says first phase of city is 60% complete\r * Cost of initial construction around $25 billion\r * Sisi says capital to mark birth of new state\r * Some Egyptians see city as inaccessible\r CAI… [+4461 chars]"
  },
  {
    "author": "Karolos Grohmann",
    "title": "Brisbane 2032 Games bid gets backing from Australian PM - Reuters",
    "description": "Brisbane's bid to host the 2032 summer Olympics got the backing of Australian Prime Minister Scott Morrison on Thursday, who told the International Olympic Committee all levels of government were firmly behind the candidacy.",
    "url": "https://www.reuters.com/article/us-olympics-ioc-brisbane-idUSKBN2B32AR",
    "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210311&t=2&i=1554556062&r=LYNXMPEH2A1DM&w=800",
    "publishedAt": "2021-03-11T16:12:00Z",
    "content": "(Reuters) - Brisbanes bid to host the 2032 summer Olympics got the backing of Australian Prime Minister Scott Morrison on Thursday, who told the International Olympic Committee all levels of governme… [+1708 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "Olympics: No Chinese vaccines to be taken by Team Japan, minister says - Reuters",
    "description": "Japanese athletes at the Summer Olympics will not be eligible for coronavirus vaccinations offered by China since Japan has not approved the vaccines, Olympics Minister Tamayo Marukawa said on Friday, according to public broadcaster NHK.",
    "url": "https://www.reuters.com/article/us-olympics-2020-vaccine-idUSKBN2B40FN",
    "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210312&t=2&i=1554629970&r=LYNXMPEH2B07Y&w=800",
    "publishedAt": "2021-03-12T05:03:00Z",
    "content": "By Reuters Staff\r FILE PHOTO: Japan's Olympic and Paralympic Games Minister Tamayo Marukawa attends a news conference, amid the coronavirus disease (COVID-19) outbreak, in Tokyo, Japan February 18, 2… [+1639 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "Japan mulls 50% cap on Olympics spectators: media - Reuters",
    "description": "Japan is considering limiting spectators for the delayed Tokyo 2020 Summer Olympics to 50% of venue capacity due to risks posed by the spread of COVID-19, the Sankei newspaper reported on Sunday.",
    "url": "https://www.reuters.com/article/us-olympics-2020-spectators-idUSKBN2B603M",
    "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210314&t=2&i=1554823221&r=LYNXMPEH2D022&w=800",
    "publishedAt": "2021-03-14T06:51:00Z",
    "content": "By Reuters Staff\r FILE PHOTO: A man looks at his mobile phone next to The Olympic rings in front of the Japan Olympics Museum in Tokyo, Japan, March 4, 2020. REUTERS/Stoyan Nenov\r TOKYO (Reuters) - J… [+1413 chars]"
  },
  {
    "author": "Clara-Laeila Laudette",
    "title": "Ryanair plans 2,500 Spanish flights a week in bet on travel recovery - Reuters",
    "description": "Ryanair is planning 2,500 flights a week to, from, and across Spain this summer as it bets on a surge in demand for holidays even as infections rise across much of Europe.",
    "url": "https://www.reuters.com/article/uk-health-coronavirus-ryanair-spain-idUSKBN2BG27B",
    "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210324&t=2&i=1556047186&r=LYNXMPEH2N1DA&w=800",
    "publishedAt": "2021-03-24T14:22:00Z",
    "content": "MADRID (Reuters) - Ryanair is planning 2,500 flights a week to, from, and across Spain this summer as it bets on a surge in demand for holidays even as infections rise across much of Europe.\r FILE PH… [+1924 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "EQT to launch sale of German energy services firm Getec in Q3 - Reuters",
    "description": "Buyout firm EQT is preparing to launch the sale of German energy services firm Getec after the summer break and has mandated an investment bank to oversee the process, people familiar with the matter said.",
    "url": "https://www.reuters.com/article/getec-sale-idUSL8N2LN384",
    "urlToImage": "https://s1.reutersmedia.net/resources_v2/images/rcom-default.png?w=800",
    "publishedAt": "2021-03-25T10:19:00Z",
    "content": "By Reuters Staff\r FRANKFURT, March 25 (Reuters) - Buyout firm EQT is preparing to launch the sale of German energy services firm Getec after the summer break and has mandated an investment bank to ov… [+477 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "Tokyo Olympics torch relay to start in Fukushima's shadow - Reuters",
    "description": "The Olympic torch relay will start in Fukushima on Thursday, kicking off a four-month countdown to the summer Games in Tokyo, delayed from 2020 and the first ever organised during a global pandemic.",
    "url": "https://www.reuters.com/article/us-olympics-2020-relay-idUSKBN2BG3ED",
    "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210324&t=2&i=1556103106&r=LYNXMPEH2N22K&w=800",
    "publishedAt": "2021-03-24T22:46:00Z",
    "content": "By Reuters Staff\r TOKYO (Reuters) - The Olympic torch relay will start in Fukushima on Thursday, kicking off a four-month countdown to the summer Games in Tokyo, delayed from 2020 and the first ever … [+2221 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "Tokyo Olympics torch relay begins in Fukushima - Reuters",
    "description": "Japan officially started the Olympic torch relay in Fukushima on Thursday, kicking off a four-month countdown to the summer games in Tokyo, delayed from 2020 and the first ever organised during a global pandemic.",
    "url": "https://www.reuters.com/article/us-olympics-2020-relay-idUSKBN2BH038",
    "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210325&t=2&i=1556112803&r=LYNXMPEH2O01Y&w=800",
    "publishedAt": "2021-03-25T01:01:00Z",
    "content": "By Reuters Staff\r FUKUSHIMA (Reuters) - Japan officially started the Olympic torch relay in Fukushima on Thursday, kicking off a four-month countdown to the summer games in Tokyo, delayed from 2020 a… [+302 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "Portugal will welcome British holidaymakers from mid-May, tourist minister says - Reuters",
    "description": "Portugal will welcome British tourists from May 17 if they have a vaccination certificate or evidence of a recent negative COVID-19 test, said the country's tourism minister, adding to hopes for a travel recovery in Europe this summer.",
    "url": "https://www.reuters.com/article/uk-health-coronavirus-britain-portugal-idUSKBN2BA0U2",
    "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210318&t=2&i=1555315793&r=LYNXMPEH2H0GV&w=800",
    "publishedAt": "2021-03-18T08:56:00Z",
    "content": "By Reuters Staff\r FILE PHOTO: A tourist wearing a mask sits at Caes de Sodre, amid the coronavirus disease (COVID-19) outbreak, in Lisbon, Portugal July 13, 2020. REUTERS/Rafael Marchante\r LONDON (Re… [+642 chars]"
  },
  {
    "author": "Reuters Editorial",
    "title": "EU threatens ban on COVID vaccine exports to UK - Reuters",
    "description": "The European Union on Wednesday threatened to ban exports of COVID-19 vaccines to Britain to safeguard scarce doses for its own citizens facing a third wave of the pandemic that would jeopardise plans to restart travel this summer.",
    "url": "https://www.reuters.com/video/watch/idPRol?now=true",
    "urlToImage": "https://ajo.prod.reuters.tv/api/v2/img/60522666e4b0653eea184b0c-1615996518624?location=LANDSCAPE",
    "publishedAt": "2021-03-17T16:42:19Z",
    "content": "Posted \r The European Union on Wednesday threatened to ban exports of COVID-19 vaccines to Britain to safeguard scarce doses for its own citizens facing a third wave of the pandemic that would jeopar… [+40 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "Germany sticks to coronavirus vaccine goal despite AstraZeneca pause - Reuters",
    "description": "Germany is sticking to its goal of offering a coronavirus vaccination to everyone by the end of the summer, a government spokeswoman said on Wednesday despite its decision this week to suspend use of AstraZeneca doses due to safety worries.",
    "url": "https://www.reuters.com/article/us-health-coronavirus-vaccine-germany-idUSKBN2B92B2",
    "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210317&t=2&i=1555225971&r=LYNXMPEH2G1CE&w=800",
    "publishedAt": "2021-03-17T15:59:00Z",
    "content": "By Reuters Staff\r FILE PHOTO: A patient receives a coronavirus disease (COVID-19) vaccine at dr. Andreas Carganico office in Berlin, where the first COVID-19 vaccinations are given in doctors' surger… [+1632 chars]"
  }
]