[
  {
    "author": "Reuters Staff",
    "title": "Kremlin dismisses U.S. call to destroy its chemical weapons as baseless - Reuters",
    "description": "The Kremlin on Thursday dismissed as baseless and illogical U.S. calls for Russia to destroy its chemicals weapons, saying that Moscow had destroyed them long ago in line with the chemical weapons convention.",
    "url": "https://www.reuters.com/article/us-russia-politics-navalny-kremlin-arms-idUSKBN2AW11U",
    "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210304&t=2&i=1553726044&r=LYNXMPEH230J5&w=800",
    "publishedAt": "2021-03-04T10:05:00Z",
    "content": "By Reuters Staff\r FILE PHOTO: Kremlin spokesman Dmitry Peskov attends Russian President Vladimir Putin's annual end-of-year news conference, held online in a video conference mode, in Moscow, Russia … [+458 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "Russian deputy PM says death rate fell 21.7% m/m in February - Reuters",
    "description": "Deputy Prime Minister Tatiana Golikova on Friday said that deaths across Russia had fallen by 9.5% on a month-on-month basis in January, and by 21.7% in February, citing data from federal statistics service Rosstat.",
    "url": "https://www.reuters.com/article/health-coronavirus-russia-death-idUSR4N2H102D",
    "urlToImage": "https://s1.reutersmedia.net/resources_v2/images/rcom-default.png?w=800",
    "publishedAt": "2021-03-05T13:59:00Z",
    "content": "By Reuters Staff\r MOSCOW, March 5 (Reuters) - Deputy Prime Minister Tatiana Golikova on Friday said that deaths across Russia had fallen by 9.5% on a month-on-month basis in January, and by 21.7% in … [+299 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "EU executive says joint vaccine strategy not unravelling - Reuters",
    "description": "The European Union's joint vaccine procurement has not unravelled, a spokesman for the European Commission said on Tuesday when asked about individual countries getting jabs from Russia or China that do not have the bloc's authorisation.",
    "url": "https://www.reuters.com/article/health-coronavirus-eu-commission-idUSL5N2L03DD",
    "urlToImage": "https://s1.reutersmedia.net/resources_v2/images/rcom-default.png?w=800",
    "publishedAt": "2021-03-02T11:27:00Z",
    "content": "By Reuters Staff\r BRUSSELS, March 2 (Reuters) - The European Unions joint vaccine procurement has not unravelled, a spokesman for the European Commission said on Tuesday when asked about individual c… [+676 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "WTA roundup: Top seed falls in Lyon opener - Reuters",
    "description": "Teen qualifier Clara Tauson of Denmark upset top-seeded Ekaterina Alexandrova of Russia 6-3, 6-4 on Monday in the first round of the Lyon Open in France.",
    "url": "https://www.reuters.com/article/us-tennis-roundup-idUSKCN2AT3RR",
    "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210301&t=2&i=1553382080&r=LYNXNPEH20275&w=800",
    "publishedAt": "2021-03-01T22:34:00Z",
    "content": "By Reuters Staff\r FILE PHOTO: Tennis - Gippsland Trophy - Melbourne Park, Melbourne, Australia, February 6, 2021 Russia's Ekaterina Alexandrova in action during her semi final match against Estonia's… [+1503 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "Slovak PM sorry for jokingly offering Ukraine territory for Russian vaccine - Reuters India",
    "description": "Slovak Prime Minister Igor Matovic apologised on Thursday after jokingly suggesting that Russia take a part of western Ukraine as payment for delivering doses of its Sputnik V vaccine to Slovakia.",
    "url": "https://www.reuters.com/article/us-slovakia-ukraine-idUSKBN2AW29J",
    "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210304&t=2&i=1553760348&r=LYNXMPEH2319A&w=800",
    "publishedAt": "2021-03-04T16:35:00Z",
    "content": "By Reuters Staff\r FILE PHOTO: Slovak Prime Minister Igor Matovic arrives for an EU summit in Brussels, Belgium, October 15, 2020. Olivier Hoslet/Pool via REUTERS/File Photo\r PRAGUE (Reuters) - Slovak… [+1626 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "U.S. bomber flies over Baltic states in show of solidarity: U.S. Air Force - Reuters",
    "description": "A nuclear-capable, long-range U.S. bomber flew over the capitals of Lithuania, Latvia and Estonia on Wednesday in a show of solidarity with NATO allies, the U.S. Air Force said, amid Western concerns over a more assertive Russia.",
    "url": "https://www.reuters.com/article/us-baltic-security-usa-idUSKBN2AV26W",
    "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210303&t=2&i=1553625627&r=LYNXMPEH22189&w=800",
    "publishedAt": "2021-03-03T16:55:00Z",
    "content": "By Reuters Staff\r U.S. Air Force Rockwell B-1B Lancer bomber accompanied by two NATO air-policing Italian Eurofighter Typhoons flies over Vilnius, Lithuania March 3, 2021. Ieva Budzekaite/Lithuanian … [+1251 chars]"
  },
  {
    "author": "Steve Holland, Arshad Mohammed",
    "title": "U.S.and EU impose sanctions on Russia over Navalny poisoning, jailing - Reuters",
    "description": "The United States on Tuesday imposed sanctions to punish Russia for what it described as Moscow's attempt to poison opposition leader Alexei Navalny with a nerve agent last year, in President Joe Biden's most direct challenge yet to the Kremlin.",
    "url": "https://www.reuters.com/article/us-russia-politics-navalny-wrap-idUSKCN2AU27Y",
    "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210302&t=2&i=1553485200&r=LYNXNPEH21196&w=800",
    "publishedAt": "2021-03-02T17:31:00Z",
    "content": "WASHINGTON (Reuters) - The United States on Tuesday imposed sanctions to punish Russia for what it described as Moscows attempt to poison opposition leader Alexei Navalny with a nerve agent last year… [+4745 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "Kremlin says Biden's Putin comment shows he has no interest in mending ties - Reuters",
    "description": "The Kremlin said on Thursday that comments by U.S. President Joe Biden that he thought Vladimir Putin was a killer clearly showed that Biden had no interest in mending ties with Moscow and that Russia would now take that into account.",
    "url": "https://www.reuters.com/article/us-russia-usa-kremlin-idUSKBN2BA166",
    "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210318&t=2&i=1555329844&r=LYNXMPEH2H0NN&w=800",
    "publishedAt": "2021-03-18T10:55:00Z",
    "content": "By Reuters Staff\r FILE PHOTO: Russian President Vladimir Putin chairs a meeting on measures to boost investment activity, via a video link at the Novo-Ogaryovo state residence outside Moscow, Russia … [+748 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "EU snipes at China and Russia, says won't use vaccines for propaganda - Reuters",
    "description": "European Council President Charles Michel on Tuesday took aim at the \"highly publicised\" supply of COVID-19 vaccines from China and Russia to other countries, and said Europe would not use vaccines for propaganda purposes.",
    "url": "https://www.reuters.com/article/health-coronavirus-eu-michel-idUSS8N2K306G",
    "urlToImage": "https://s1.reutersmedia.net/resources_v2/images/rcom-default.png?w=800",
    "publishedAt": "2021-03-09T14:18:00Z",
    "content": "By Reuters Staff\r BRUSSELS, March 9 (Reuters) - European Council President Charles Michel on Tuesday took aim at the highly publicised supply of COVID-19 vaccines from China and Russia to other count… [+649 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "No contract signed to produce Russian COVID-19 shot, says French official - Reuters",
    "description": "No company in France has signed a contract with Russia to produce its COVID-19 Sputnik V vaccine, a spokesman for France's industry minister said on Tuesday, appearing to contradict the head of Russia's RDIF sovereign wealth fund.",
    "url": "https://www.reuters.com/article/us-health-coronavirus-russia-france-sput-idUSKBN2B12C8",
    "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210309&t=2&i=1554296027&r=LYNXMPEH28184&w=800",
    "publishedAt": "2021-03-09T18:05:00Z",
    "content": "By Reuters Staff\r FILE PHOTO: A medical specialist holds a vial of Sputnik V vaccine against the coronavirus in a department store in Moscow, Russia, January 18, 2021 REUTERS/Shamil Zhumatov/File Pho… [+631 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "Allies of jailed Kremlin critic Navalny unveil plan for big spring protest - Reuters.com",
    "description": "Allies of jailed Kremlin critic Alexei Navalny said on Tuesday they wanted to stage the biggest anti-Kremlin street protest in modern Russian history this spring to demand the opposition politician's release.",
    "url": "https://www.reuters.com/article/us-russia-politics-navalny-protest-idUSKBN2BF1NK",
    "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210323&t=2&i=1555889453&r=LYNXMPEH2M0XK&w=800",
    "publishedAt": "2021-03-23T12:49:00Z",
    "content": "By Reuters Staff\r FILE PHOTO: Kremlin critic Alexei Navalny, who is accused of slandering a Russian World War Two veteran, stands inside a defendant dock during a court hearing in Moscow, Russia, Rus… [+1598 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "Ukraine producers promise to keep key food prices stable - Reuters",
    "description": "Leading food producers' associations in Ukraine have told the government they will keep domestic prices stable for several popular food items to help stave off inflation already hitting neighbouring Russia, unions said on Thursday.",
    "url": "https://www.reuters.com/article/ukraine-agriculture-prices-idUSL1N2LG0ZW",
    "urlToImage": "https://s1.reutersmedia.net/resources_v2/images/rcom-default.png?w=800",
    "publishedAt": "2021-03-18T12:10:00Z",
    "content": "By Reuters Staff\r KYIV, March 18 (Reuters) - Leading food producers associations in Ukraine have told the government they will keep domestic prices stable for several popular food items to help stave… [+1227 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "Afghan government, Taliban agree to accelerate peace talks after Moscow summit: RIA - Reuters.com",
    "description": "The Afghan government and the Taliban have agreed to accelerate peace talks after Russia hosted an international conference aimed at reviving a stalled peace process, the RIA news agency reported on Friday, citing a senior Afghan official.",
    "url": "https://www.reuters.com/article/us-usa-afghanistan-peaceplan-russia-tali-idUSKBN2BB0QQ",
    "urlToImage": "https://s1.reutersmedia.net/resources_v2/images/rcom-default.png?w=800",
    "publishedAt": "2021-03-19T08:35:00Z",
    "content": "By Reuters Staff\r MOSCOW (Reuters) - The Afghan government and the Taliban have agreed to accelerate peace talks after Russia hosted an international conference aimed at reviving a stalled peace proc… [+214 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "Russia warns it will 'have to react' if Bosnia moves to join NATO - Reuters",
    "description": "Russia will react if Bosnia takes steps towards joining NATO because Moscow would perceive this as a hostile act, the Russian embassy in Bosnia said in a statement on Thursday.",
    "url": "https://www.reuters.com/article/us-bosnia-russia-nato-idUSKBN2BA2FL",
    "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210318&t=2&i=1555381972&r=LYNXMPEH2H1DT&w=800",
    "publishedAt": "2021-03-18T18:09:00Z",
    "content": "By Reuters Staff\r FILE PHOTO: Banners displaying the NATO logo are placed at the entrance of new NATO headquarters during the move to the new building, in Brussels, Belgium April 19, 2018. REUTERS/Yv… [+1623 chars]"
  },
  {
    "author": "Darya Korsunskaya",
    "title": "Russia, under fresh U.S. sanctions threat, says ready to issue Eurobond soon - Reuters",
    "description": "Russia stands ready to tap the Eurobond market any moment, and it expects foreigners' share among holders of its OFZ treasury bonds to stabilise in 2021 despite the threat of fresh U.S. sanctions, a deputy finance minister told Reuters.",
    "url": "https://www.reuters.com/article/us-russia-debt-idUSKBN2BE1F4",
    "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210322&t=2&i=1555736829&r=LYNXMPEH2L0XK&w=800",
    "publishedAt": "2021-03-22T11:26:00Z",
    "content": "MOSCOW (Reuters) - Russia stands ready to tap the Eurobond market any moment, and it expects foreigners share among holders of its OFZ treasury bonds to stabilise in 2021 despite the threat of fresh … [+2646 chars]"
  },
  {
    "author": "Gleb Stolyarov",
    "title": "Rising fuel prices compound Russian airlines' pandemic woes - Reuters",
    "description": "Demand for domestic air travel is rising in Russia but not nearly as strongly as fuel prices, squeezing airlines' still-brittle finances, as competition between carriers helps to rein in fares.",
    "url": "https://www.reuters.com/article/us-russia-airlines-fuel-idUSKBN2BF1AH",
    "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210323&t=2&i=1555876059&r=LYNXMPEH2M0OU&w=800",
    "publishedAt": "2021-03-23T11:02:00Z",
    "content": "MOSCOW (Reuters) - Demand for domestic air travel is rising in Russia but not nearly as strongly as fuel prices, squeezing airlines still-brittle finances, as competition between carriers helps to re… [+2685 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "At NATO, Blinken warns Germany over Nord Stream 2 - Reuters",
    "description": "U.S. Secretary of State Antony Blinken said on Tuesday the Nord Stream 2 pipeline, under construction from Russia to Germany, ran counter to the European Union's own interests and undermined Ukraine.",
    "url": "https://www.reuters.com/article/us-usa-blinken-nato-nordstream-idUSKBN2BF0TE",
    "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210323&t=2&i=1555858411&r=LYNXMPEH2M0G0&w=800",
    "publishedAt": "2021-03-23T08:17:00Z",
    "content": "By Reuters Staff\r BRUSSELS (Reuters) - U.S. Secretary of State Antony Blinken said on Tuesday the Nord Stream 2 pipeline, under construction from Russia to Germany, ran counter to the European Unions… [+152 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "UPDATE 1-Pizza firm DP Eurasia core profit falls as pandemic curbs operations - Reuters",
    "description": "Pizza firm DP Eurasia, which runs the Domino's Pizza brand in Turkey and Russia, reported a decline of 44.1% in its 2020 core profit as it came under pressure due to coronavirus-related restrictions.",
    "url": "https://www.reuters.com/article/russia-dp-eurasia-results-idUSL1N2LL0E0",
    "urlToImage": "https://s1.reutersmedia.net/resources_v2/images/rcom-default.png?w=800",
    "publishedAt": "2021-03-23T08:12:00Z",
    "content": "By Reuters Staff\r (Adds detail, quote)\r March 23 (Reuters) - Pizza firm DP Eurasia, which runs the Dominos Pizza brand in Turkey and Russia, reported a decline of 44.1% in its 2020 core profit as it … [+1343 chars]"
  },
  {
    "author": "Reuters Staff",
    "title": "RDIF says 3.5 million Russians have received both shots of Sputnik V - Reuters",
    "description": "Russia has vaccinated 3.5 million people with both shots of its Sputnik V vaccine against COVID-19, Kirill Dmitriev, boss of Russia's RDIF sovereign wealth fund, said on Monday.",
    "url": "https://www.reuters.com/article/us-health-coronavirus-vaccine-russia-inn-idUSKBN2B70TX",
    "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210315&t=2&i=1554911276&r=LYNXMPEH2E0JR&w=800",
    "publishedAt": "2021-03-15T08:17:00Z",
    "content": "By Reuters Staff\r FILE PHOTO: A nurse inoculates a volunteer with Russia's \"Sputnik-V\" vaccine against the coronavirus disease (COVID-19) in a post-registration trials stage at a clinic in Moscow, Ru… [+410 chars]"
  },
  {
    "author": "Abdul Qadir Sediqi, Hamid Shalizi",
    "title": "Afghan leaders invited by Russia to meeting on struggling peace process - Reuters",
    "description": "Afghan political leaders including former president Hamid Karzai are mulling whether to attend a meeting organised by Russia to jumpstart Afghanistan's peace process as diplomacy by foreign powers including Washington ramps up.",
    "url": "https://www.reuters.com/article/us-usa-afghanistan-peaceplan-russia-idUSKBN2B329V",
    "urlToImage": "https://s1.reutersmedia.net/resources_v2/images/rcom-default.png?w=800",
    "publishedAt": "2021-03-11T15:56:00Z",
    "content": "KABUL (Reuters) - Afghan political leaders including former president Hamid Karzai are mulling whether to attend a meeting organised by Russia to jumpstart Afghanistans peace process as diplomacy by … [+2253 chars]"
  }
]