[
  {
    "author": "Michael Allison",
    "title": "Walmart prepares to launch its first Android TV streaming stick",
    "description": "You'll be able to by a TV and an Android TV stick to go with it.    What you need to know   Walmart is preparing to launch an Android TV stick under the Onn brand. Images of the upcoming streaming device found their way to social media from the company's FCC …",
    "url": "https://www.androidcentral.com/walmart-preparing-launch-its-own-android-tv-stick",
    "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2018/05/android-tv-android-p-interface-beta.jpg",
    "publishedAt": "2021-03-16T01:09:35Z",
    "content": "It's already pretty cheap to jump into the Android TV ecosystem, and Walmart is lowering the cost of entry even further. The retail giant is making its own Android TV stick, according to an FCC listi… [+1532 chars]"
  },
  {
    "author": "Hayato Huseman",
    "title": "What messaging apps do the Android Central staff use?",
    "description": "The best option isn't always necessarily the preferred option.  Messaging is a huge part of how we use our phones in our daily lives — after all, these are communication tools, first and foremost. The best messaging apps are generally the ones that the most p…",
    "url": "https://www.androidcentral.com/staff-favorite-messaging-apps",
    "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2021/02/telegram-vs-signal-vs-whatsapp-hero-2.jpeg",
    "publishedAt": "2021-03-19T13:30:02Z",
    "content": "Source: Joe Maring / Android Central\r Messaging is a huge part of how we use our phones in our daily lives after all, these are communication tools, first and foremost. The best messaging apps are ge… [+24539 chars]"
  },
  {
    "author": "Hayato Huseman",
    "title": "How to use Twitter's Clubhouse clone on Android",
    "description": "By now, you've probably seen iOS users tweeting and posting about Clubhouse, an audio-based social network that, for the moment, is limited to iPhones only. No need to feel too left out, though; Twitter has developed its own version of the platform called Spa…",
    "url": "https://www.androidcentral.com/how-use-twitter-spaces",
    "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2021/03/twitter-spaces-hero.jpg",
    "publishedAt": "2021-03-10T14:30:02Z",
    "content": "By now, you've probably seen iOS users tweeting and posting about Clubhouse, an audio-based social network that, for the moment, is limited to iPhones only. No need to feel too left out, though; Twit… [+2688 chars]"
  },
  {
    "author": "Jeramy Johnson",
    "title": "Do you still use Android 11's chat bubbles?",
    "description": "Chatting with the AC forums.    Android 11 didn't have a lot of whiz-bang new features, but one that it brought to the masses certainly \"popped\" out, and that was Chat Bubbles. The first implementation of the Chat Bubbles concept was introduced a while ago by…",
    "url": "https://www.androidcentral.com/do-you-still-use-android-11s-chat-bubbles",
    "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2020/07/android-11-chat-bubbles-how-to-hero-1.jpg",
    "publishedAt": "2021-03-25T11:48:44Z",
    "content": "Android 11 didn't have a lot of whiz-bang new features, but one that it brought to the masses certainly \"popped\" out, and that was Chat Bubbles. The first implementation of the Chat Bubbles concept w… [+2122 chars]"
  },
  {
    "author": "Michael Allison",
    "title": "Clubhouse's Android app is 'months' away as competitors build clones",
    "description": "Facebook and Twitter are happy to pick up the slack.    What you need to know   Clubhouse exploded in popularity earlier during the later months of 2020. An Android app was announced earlier this year, and founder Paul Davison clarified it would be landing in…",
    "url": "https://www.androidcentral.com/clubhouses-android-app-coming-months",
    "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2021/03/twitter-spaces-hero.jpg",
    "publishedAt": "2021-03-23T17:12:24Z",
    "content": "Social media app du jour, Clubhouse, previously published in a blog post that it would be coming to Android. Even though it had exploded in popularity recently, the invite-only, iOS-only app was buil… [+1397 chars]"
  },
  {
    "author": "Derrek Lee",
    "title": "Qualcomm is developing its own Nintendo Switch alternative running Android",
    "description": "Qualcomm is going all-in on Android gaming.  What you need to know   Reports point to Qualcomm working on its own Android-powered gaming console. The console would feature a Nintendo Switch-like setup with detachable controllers. It will likely run Android 12…",
    "url": "https://www.androidcentral.com/qualcomm-developing-nintendo-switch-android-gaming-console",
    "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2017/12/Nintendo-Switch-Joe-Favorite-Things_0.JPG",
    "publishedAt": "2021-03-23T20:34:19Z",
    "content": "Android smartphones are becoming increasingly powerful, with many of the best phones for gamers rivaling even some laptops. The ASUS ROG Phone 5 tops out at an impressive 18GB, which is more than twi… [+1799 chars]"
  },
  {
    "author": "Michael Allison",
    "title": "Signal will soon let Android users wirelesly transfer their data",
    "description": "Signal's newest update will make switching phones faster    What you need to know   Signal is rolling out a beta update that enables wireless account migration. It allows a user to easily transfer their account between devices without the need for a local bac…",
    "url": "https://www.androidcentral.com/signals-newest-update-lets-you-migrate-between-devices",
    "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/field/image/2021/01/signal-hero-1-516e.jpg",
    "publishedAt": "2021-03-15T23:28:07Z",
    "content": "Signal, the messaging app that is set to replace WhatsApp for the most privacy-focused users, is borrowing one of WhatsApp's most useful features with wireless account migration. Have you ever though… [+1398 chars]"
  },
  {
    "author": "Jeramy Johnson",
    "title": "How has your experience with Android Auto been?",
    "description": "Chatting with the AC forums.    Like Apple's CarPlay, Android Auto is intended to be a supplement to, or replacement for, your car manufacturer's in-dash infotainment system. It is meant to provide a distraction-free, or at least less distracting, portal for …",
    "url": "https://www.androidcentral.com/how-has-your-experience-android-auto-been",
    "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/field/image/2019/05/new-android-auto7-u5vz.jpg",
    "publishedAt": "2021-03-17T11:52:56Z",
    "content": "Like Apple's CarPlay, Android Auto is intended to be a supplement to, or replacement for, your car manufacturer's in-dash infotainment system. It is meant to provide a distraction-free, or at least l… [+1905 chars]"
  },
  {
    "author": "Jerry Hildenbrand",
    "title": "Android 12 is bringing more transparent privacy controls",
    "description": "Android 12 helps you know exactly what apps are tracking your location, using the camera, and using the microphone when it's happening.  In Android 11, we saw the debut of a popular privacy feature: a one-time permission setting for getting your location in t…",
    "url": "https://www.androidcentral.com/android-12-brings-more-transparent-privacy-tools-location-camera-and-microphone-usage",
    "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2021/02/android-12-ac-homepage-1.jpg",
    "publishedAt": "2021-03-22T20:00:03Z",
    "content": "In Android 11, we saw the debut of a popular privacy feature: a one-time permission setting for getting your location in the background, using your microphone, or using the camera. That's a great thi… [+3187 chars]"
  },
  {
    "author": "Zackery Cuevas",
    "title": "Rocket League Sideswipe is coming to Android devices in 2021",
    "description": "An all new Rocket League exclusive for mobile.  What you need to know   Rocket League Sideswipe is a new standalone release set to release worldwide in 2021. The new release introduces a two-dimensional perspective and new touch screen controls. Alpha tests s…",
    "url": "https://www.androidcentral.com/psyonix-announces-rocket-league-sideswipe-coming-mobile-later-year",
    "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2021/03/rocket-league-sideswipe-hero.jpg",
    "publishedAt": "2021-03-24T17:00:03Z",
    "content": "Rocket League developer Psyonix announced that it's bringing its competitive car soccer game to mobile devices in the form of Rocket League Sideswipe, and it will launch later this year.\r According t… [+1351 chars]"
  },
  {
    "author": "Jim Metzendorf",
    "title": "AC Podcast 518: OnePlus 9 and OnePlus 9 Pro Review",
    "description": "Hayato, Alex, and Daniel are here with their reviews of the brand new OnePlus 9 and OnePlus 9 Pro.  Listen now    androidcentral) - Subscribe in Spotify: Audio - Subscribe in iTunes: Audio  - Subscribe in RSS: Audio - Download directly: Audio    Links:   OneP…",
    "url": "https://www.androidcentral.com/ac-podcast-518-oneplus-9-and-oneplus-9-pro-review",
    "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2021/03/oneplus-9-vs-oneplus-9-pro-16.jpg",
    "publishedAt": "2021-03-23T15:12:38Z",
    "content": "Hayato, Alex, and Daniel are here with their reviews of the brand new OnePlus 9 and OnePlus 9 Pro.\r androidcentral)\r - Subscribe in Spotify: Audio\r - Subscribe in iTunes: Audio\r - Subscribe in RSS: A… [+31 chars]"
  },
  {
    "author": "Carrie Mihalcik",
    "title": "Facebook adds hardware security key option for iOS, Android - CNET",
    "description": "A physical security can now be used for two-factor authentication on a mobile device.",
    "url": "https://www.cnet.com/news/facebook-adds-hardware-security-key-option-for-ios-android/",
    "urlToImage": "https://cnet2.cbsistatic.com/img/32Lj8KQtle0e336PeZmiY85dOh0=/1200x630/2021/03/18/e6e08eda-98ef-40cd-9d1f-9cc52ff9cb08/nrp-expanding-support-for-security-keys-on-mobile-devices-banner.jpg",
    "publishedAt": "2021-03-18T14:34:00Z",
    "content": "Facebook\r Facebook is expanding its support for hardware security keys to iOS and Android devices. The feature, available worldwide starting Thursday, lets you enable two-factor authentication to log… [+624 chars]"
  },
  {
    "author": "Babu Mohan",
    "title": "The Google TV app will soon make it a lot easier to control your Android TV",
    "description": "The Android TV Remote Control app could finally be discontinued this year.    What you need to know   The Google TV app for Android could soon receive a major update. Google is working on adding a remote control feature to the app. Once the feature rolls out,…",
    "url": "https://www.androidcentral.com/the-google-tv-app-will-soon-make-easier-control-android-tv",
    "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2020/09/hisense-h9g-review-1.jpeg",
    "publishedAt": "2021-03-02T14:15:12Z",
    "content": "Google is rolling out a new update to the Google TV app, which was previously called Play Movies &amp; TV. While the latest Google TV v4.25 update for Android only brings stability improvements and b… [+1266 chars]"
  },
  {
    "author": null,
    "title": "Haircut in the Hague after lockdown",
    "description": "Hairdressers in the Netherlands have reopened after being shut since December.",
    "url": "https://www.bbc.co.uk/news/av/world-europe-56287659",
    "urlToImage": "https://ichef.bbci.co.uk/images/ic/400xn/p01tlf61.jpg",
    "publishedAt": "2021-03-04T22:36:36Z",
    "content": "Hairdressers in the Netherlands have reopened after being shut since December. \r Many clients who couldn't wait for cut or colour were relieved to get back into the stylist's chair, including the BBC… [+188 chars]"
  },
  {
    "author": "Derrek Lee",
    "title": "Hulu on Android TV no longer limited to 720p streams, still no sign of 4K",
    "description": "It might be some time before Android TV users get 4K streaming on Hulu.  What you need to know   Android TV users are finally getting access to FHD streams on Hulu. Until now, the app has been limited to 720p streams, while other apps have already moved to 4K…",
    "url": "https://www.androidcentral.com/android-tv-hulu-now-supports-1080p-streaming",
    "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2019/07/hulu-banner-hero.jpg",
    "publishedAt": "2021-03-25T19:49:09Z",
    "content": "Android TV users have many options to stream content, but the Hulu app has unfortunately been stuck in the early 2000s, only supporting 720p streams on 4K TVs. Fortunately, Hulu subscribers using the… [+1384 chars]"
  },
  {
    "author": "Michael Allison",
    "title": "The Galaxy S21 has better 5G download speeds than the iPhone 12",
    "description": "5G is better on Android, according to OpenSignal.    What you need to know   An Opensignal report shed some light on 5G performance on Android phones vs iPhones in the US. Android phones outperformed the iPhone, with even cheap phones like the A51 pulling ahe…",
    "url": "https://www.androidcentral.com/samsungs-a51-5g-has-better-5g-speeds-iphone-12",
    "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2019/05/galaxy-s10-5g-test-details.jpg",
    "publishedAt": "2021-03-16T00:14:53Z",
    "content": "If you're buying an Android phone this year, you'll likely have 5G onboard. Whether it's the ostentatious Galaxy S21 Ultra, the sensible Pixel 5, or even the cheap Nord N10, there's going to be a 5G … [+1746 chars]"
  },
  {
    "author": "Jim Metzendorf",
    "title": "Jiggle Physics 074: Life is Strange; Animal Crossing: New Horizons",
    "description": "This week, we check out the Life is Strange series from Square Enix, the Black Panther expansion for Marvel's Avengers, and more upcoming games. The crew also look back at the past year of Animal Crossing: New Horizons, a game that is helping millions of peop…",
    "url": "https://www.androidcentral.com/jiggle-physics-074-life-strange-animal-crossing-new-horizons",
    "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2019/11/jiggle-physics_art.jpg",
    "publishedAt": "2021-03-23T20:35:51Z",
    "content": "This week, we check out the Life is Strange series from Square Enix, the Black Panther expansion for Marvel's Avengers, and more upcoming games. The crew also look back at the past year of Animal Cro… [+244 chars]"
  },
  {
    "author": "Stan Schroeder",
    "title": "Xiaomi Mi 11 Pro and Ultra are coming on March 29",
    "description": "When Xiaomi launched the Mi 11\r , it notably didn’t unveil a “Pro” version.  Rumors, however, indicated that more powerful versions were coming later. Now it's official: Xiaomi will launch the Mi 11 Pro and Mi 11 Ultra on March 29.     \r  \r  More powerful ver…",
    "url": "https://mashable.com/article/xiaomi-mi-ultra-march-29/",
    "urlToImage": "https://mondrian.mashable.com/2021%252F03%252F23%252Fab%252F8b9692c03dd7492292bc6d4f5e6ab05a.57986.jpg%252F1200x630.jpg?signature=UdGFVtuo2WeOuc2hrBzjZKqvdl0=",
    "publishedAt": "2021-03-23T13:49:37Z",
    "content": "When Xiaomi launched the Mi 11\r , it notably didnt unveil a Pro version. \r Rumors, however, indicated that more powerful versions were coming later. Now it's official: Xiaomi will launch the Mi 11 Pr… [+1362 chars]"
  },
  {
    "author": "Andrew Hoyle",
    "title": "OnePlus 9 Pro review: A classy phone with good enough cameras - CNET",
    "description": "With a gorgeous design, a beautiful screen and tons of power, the OnePlus 9 Pro is a solid Android flagship.",
    "url": "https://www.cnet.com/news/review-oneplus-9-pro-classy-phone-good-enough-hasselblad-cameras/",
    "urlToImage": "https://www.cnet.com/a/img/7t4ORRPR442ClrRrRsQJKA_FjpU=/1200x630/2021/03/22/81f40609-3487-46ac-8f8e-a9507bf3b748/oneplus-9-pro-hoyle-promo-33.jpg",
    "publishedAt": "2021-03-23T16:46:25Z",
    "content": "Andrew Hoyle/CNET\r There's no question that the OnePlus 9 Pro is the best phone OnePlus has ever made, but that doesn't mean it's the one you should buy. The standard OnePlus 9 with its much more app… [+13027 chars]"
  },
  {
    "author": "Stan Schroeder",
    "title": "Crypto wallet MetaMask now lets you swap tokens on your phone",
    "description": "MetaMask, one of the most popular web wallets for cryptocurrency platform Ethereum, went mobile on iOS and Android in September 2020. However, the mobile version wasn't updated at the same pace as the web version — in particular, the ability to exchange one c…",
    "url": "https://mashable.com/article/metamask-swaps/",
    "urlToImage": "https://mondrian.mashable.com/2021%252F03%252F17%252F70%252Ff4c249ddc7404d84a6ec54aa02689419.07a92.png%252F1200x630.png?signature=OesoJsE5KfVRwuvmM2a_0WKHV8M=",
    "publishedAt": "2021-03-17T16:00:00Z",
    "content": "MetaMask, one of the most popular web wallets for cryptocurrency platform Ethereum, went mobile on iOS and Android in September 2020. However, the mobile version wasn't updated at the same pace as th… [+1807 chars]"
  }
]